<?php

return array(
    'filter_title' => array(
        'blacklist' => 'Μαύρη',
        'keywords_desc' => 'Κάθε γραμμή ελέγχεται ξεχωριστά. Εκτός από τα κανονικά κείμενα, μπορούν επίσης να οριστούν εκφράσεις RegEX. Αυτά πρέπει να είναι σε θέση να αξιολογηθούν χρησιμοποιώντας τη λειτουργία PHP preg_match.',
        'mark_as_read' => 'Σήμανση ως αναγνωσμένο',
        'mark_as_read_hint' => 'Αν αυτό το πλαίσιο ελέγχου είναι επιλεγμένο, οι μη εξουσιοδοτημένες καταχωρήσεις θα εξακολουθούν να εισάγονται στη βάση δεδομένων αλλά θα σημειώνονται ως αναγνωσμένες',
        'priority_hint' => 'Σημειώστε ότι η μαύρη λίστα έχει υψηλότερη προτεραιότητα από τη λευκή λίστα!',
        'warning' => [
            'not_allowed_msg' => '"%s" είναι απαγορευμένη λέξη-κλειδί. Επικοινωνήστε με το διαχειριστή σας για περισσότερες πληροφορίες.',
        ],
        'whitelist' => 'Λευκή Λίστα',
    ),
);
