<?php

return array(
    'filter_title' => array(
        'blacklist' => 'القائمة السوداء',
        'keywords_desc' => 'يتم التحقق من كل سطر على حدة. بالإضافة إلى النصوص العادية، يمكن أيضا تعريف عبارات RegEex. يجب أن تكون هذه قابلة للتقييم باستخدام وظيفة PHP preg_match.',
        'mark_as_read' => 'وضع علامة كمقروء',
        'mark_as_read_hint' => 'إذا تم تحديد خانة الاختيار هذه، ستظل الإدخالات غير المصرح بها في قاعدة البيانات ولكن سيتم وضع علامة كمقروء',
        'priority_hint' => 'لاحظ أن القائمة السوداء لها أولوية أعلى من القائمة البيضاء!',
        'warning' => [
            'not_allowed_msg' => '"%s" كلمة رئيسية محظورة. اتصل بالمسؤول الخاص بك للحصول على مزيد من المعلومات.',
        ],
        'whitelist' => 'القائمة البيضاء',
    ),
);
