<?php

return array(
    'YouTubeChannel2RssFeed' => array(
        '3rd_party' => array(
            'help' => array(
                'lnk_txt' => 'الوثائق',
                'text' => 'يمكن العثور هنا على تفاصيل حول التكوين والوظيفة :',
            ),
            'hint' => 'مع مساعدة عنوان URL الذي سيتم تحديده، يمكن التعرف على اختصار اليوتيوب من ناحية، ويمكن تحويل شانديلات اليوتيوب إلى تغذية من ناحية أخرى',
            'instance' => 'مثال:',
            'url' => 'الرابط',
        ),
        'install' => array(
            'bad_freshrss' => '`YouTubeChannel2RssFeed`مطلوبة على الأقل إصدار FreshRSS `%s`. (أنت تستخدم FreshRSS version `%s`)',
        ),
        'shorts' => array(
            'duration' => array(
                'label' => 'المدة بالثواني',
                'hint' => 'إذا قمت بتعيين مدة أكبر من 0، سيتم تحديد جميع مقاطع الفيديو الأقصر على أنها قصيرة، حتى إذا قال يوتيوب أنها ليست قصيرة.',
            ),
            'label' =>  'يوتيوب قصير',
            'hint' => 'يتم إجراء هذا الإعداد فقط إذا تم تخزين عنوان URL للمثال. إذا لم يتم إيداع أي منها، يسمح بالإختصار.',
            'options' => array(
                'default' => array(
                    'text' => 'الافتراضي',
                    'title' => 'لم يتم التحقق من اختصار اليوتيوب و إضافة إدخال الخلاصة إلى قاعدة البيانات كالمعتاد.',
                ),
                'block' => array(
                    'text' => 'كتلة',
                    'title' => 'إذا تم التعرف على إدخال التحديث الجديد كقصير يوتيوب، فلن يتم إضافته إلى قاعدة البيانات.',
                ),
                'mark_as_read' => array(
                    'text' => 'وضع علامة كمقروء',
                    'title' => 'إذا تم التعرف على إدخال الخلاصة الجديدة كخاصية يوتيوب، فسيتم وضع علامة كمقروء.',
                ),
            ),
        ),
    ),
);
