<?php

return array(
    'filter_title' => array(
        'blacklist' => 'Чорний список',
        'keywords_desc' => 'Кожен рядок перевіряється індивідуально. Крім нормальних текстів, можуть бути визначені також регулярні вирази (RegEx). Ці функції мають бути виконані з PHP preg_match.',
        'mark_as_read' => 'Відмітити як прочитане',
        'mark_as_read_hint' => 'Якщо позначено цей прапорець, неавторизовані записи все ще будуть введені у базу даних, але будуть позначені як прочитані',
        'priority_hint' => 'Зверніть увагу, що чорний список має вищий пріоритет, ніж білий список!',
        'warning' => [
            'not_allowed_msg' => '"%s" є забаненим ключовим словом. Зверніться до свого адміністратора для отримання додаткової інформації.',
        ],
        'whitelist' => 'Додати в білий список',
    ),
);
