<?php

return array(
    'YouTubeChannel2RssFeed' => array(
        '3rd_party' => array(
            'help' => array(
                'lnk_txt' => 'Τεκμηρίωση',
                'text' => 'Λεπτομέρειες σχετικά με τη διαμόρφωση και τη λειτουργία μπορείτε να βρείτε εδώ:',
            ),
            'hint' => 'Με τη βοήθεια του URL που θα καθοριστεί, Μπορείτε να εντοπίσετε το YouTube Shorts από τη μία πλευρά και τα χέρια YouTube μπορούν να μετατραπούν σε feeds από την άλλη',
            'instance' => 'Παρουσίαση των:',
            'url' => 'URL',
        ),
        'install' => array(
            'bad_freshrss' => '`YouTubeChannel2RssFeed`απαιτείται τουλάχιστον FreshRSS version `%s`. (Χρησιμοποιείτε FreshRSS version `%s`)',
        ),
        'shorts' => array(
            'duration' => array(
                'label' => 'Διάρκεια σε δευτερόλεπτα',
                'hint' => 'Αν ορίσετε μια διάρκεια μεγαλύτερη από 0, όλα τα μικρότερα βίντεο θα προσδιοριστούν ως σύντομα, ακόμα και αν το YouTube λέει ότι δεν είναι σύντομο.',
            ),
            'label' =>  'Σορτς Στο Youtube',
            'hint' => 'Αυτή η ρύθμιση λαμβάνεται μόνο αν μια παρουσία URL είναι αποθηκευμένη. Αν δεν κατατεθεί καμία, επιτρέπονται σορτς.',
            'options' => array(
                'default' => array(
                    'text' => 'Προεπιλογή',
                    'title' => 'Δεν υπάρχει έλεγχος για το YouTube Shorts και η καταχώριση ροής προστίθεται στη βάση δεδομένων ως κανονικό.',
                ),
                'block' => array(
                    'text' => 'Αποκλεισμός',
                    'title' => 'Αν η νέα καταχώριση ροής αναγνωριστεί ως Youtube Short, δεν θα προστεθεί στη βάση δεδομένων.',
                ),
                'mark_as_read' => array(
                    'text' => 'Σήμανση ως αναγνωσμένο',
                    'title' => 'Αν η νέα καταχώριση τροφοδοσίας αναγνωριστεί ως Youtube Short, θα επισημανθεί ως αναγνωσμένη.',
                ),
            ),
        ),
    ),
);
